tap "homebrew/bundle"

# Core tools
brew "git"
brew "gh"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "starship"
brew "mise"
brew "tree-sitter"

# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Languages
brew "rust-analyzer"
brew "python@3.11"

# Window management
brew "yabai"
brew "skhd"

# Casks
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
cask "karabiner-elements"
cask "spotify"
