tap "homebrew/bundle"
tap "koekeishiya/formulae"

# Core tools
brew "git"
brew "git-lfs"
brew "gh"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "starship"
brew "mise"
brew "tree-sitter"
brew "docker"

# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Language tooling (runtimes managed by rustup/mise/xcode)
brew "rust-analyzer"
brew "cmake"

# Window management
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

# Casks
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
cask "karabiner-elements"
cask "spotify"
